RSN/src/InformationRegisters/Оповещения/Оповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Оповещения</name>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеВложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяИнициации</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/Оповещения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Для внутреннего использования.
// 
Процедура ДобавитьОповещение(Параметры) Экспорт
	
	Оповещение = СоздатьМенеджерЗаписи();   
	Оповещение.Идентификатор = Параметры.Идентификатор;
	Оповещение.ВремяИнициации = Параметры.ВремяИнициации;
	
	Оповещение.Тема = Параметры.Тема;
	Оповещение.Сообщение = Параметры.Сообщение;
	Оповещение.ТипТекста = Параметры.ТипТекста;
	Оповещение.Получатели = Параметры.Получатели;
	Если ЗначениеЗаполнено(Параметры.РасширениеВложения) Тогда
		Оповещение.Вложение = Параметры.Вложение;
		Оповещение.РасширениеВложения = Параметры.РасширениеВложения; 
		Оповещение.ИмяФайлаВложения = Параметры.ИмяФайлаВложения;
	КонецЕсли;
			
	Оповещение.Записать(Истина);
				
КонецПроцедуры

Процедура ЗаписатьРезультатОтправкиОповещения(Параметры) Экспорт
	
	Оповещение = СоздатьМенеджерЗаписи();   
	Оповещение.Идентификатор = Параметры.Идентификатор;
	Оповещение.ВремяИнициации = Параметры.ВремяИнициации;
	Оповещение.Прочитать(); 			
	
	Если Оповещение.Выбран() Тогда
		Если Параметры.Свойство("ТекстОшибки") И ЗначениеЗаполнено(Параметры.ТекстОшибки) Тогда
			Оповещение.Отправлено  = Ложь;
			Оповещение.ТекстОшибки = Параметры.ТекстОшибки; 
		Иначе
			Оповещение.Отправлено  = Истина;
			Оповещение.ТекстОшибки = "";	
		КонецЕсли;
		Оповещение.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
